{
  "meta": {
    "title": "battle_spells_api",
    "patch_notes": "27-11-2025",
    "author": {
      "Adji Rivaldi": "https://www.instagram.com/rrival_dii/",
      "Dimas Sadewa": "https://www.instagram.com/d.dewaaaa/",
      "Rizky Fahrezi": "https://www.instagram.com/rzkydev666/"
    },
    "source": "https://github.com/rzkyfhrzi21/mlbb-tutorial-api",
    "description": "Data Battle Spell Mobile Legends: Bang Bang berisi ikon, nama, fungsi, deskripsi, cooldown, dan level unlock dalam format API."
  },
  "data": [
    {
      "icon": "/assets/battle_spells/recall.png",
      "name": "Recall",
      "usage": "Kembali ke base",
      "description": "Menggunakan channel selama beberapa detik untuk berteleportasi kembali ke base. Jika terkena damage selama proses channeling, teleportasi akan dibatalkan.",
      "cooldown": 0,
      "unlocked_at_level": 0
    },
    {
      "icon": "/assets/battle_spells/regen.png",
      "name": "Regen",
      "usage": "Pemulihan HP dan Mana",
      "description": "Memulihkan 120 (+25) HP dan mengembalikan (+0) Mana per detik selama 5 detik. Efek ini akan terputus jika pengguna menerima damage dari hero musuh, creep hutan besar, atau musuh non-minion lainnya.",
      "cooldown": 60,
      "unlocked_at_level": 0
    },
    {
      "icon": "/assets/battle_spells/execute.png",
      "name": "Execute",
      "usage": "Finisher single target",
      "description": "Mengeluarkan serangan eksekusi ke satu hero musuh, memberikan True Damage yang meningkat berdasarkan level hero dan persentase HP yang sudah hilang dari target. Damage mengabaikan shield, dan jika target terbunuh cooldown skill ini berkurang secara signifikan.",
      "cooldown": 90,
      "unlocked_at_level": 1
    },
    {
      "icon": "/assets/battle_spells/retribution.png",
      "name": "Retribution",
      "usage": "Jungle dan farming",
      "description": "Memberikan True Damage besar ke creep dan minion. Mempercepat farming dengan menambah hadiah dari creep dan mengurangi damage yang diterima dari creep, tetapi mengurangi gold dan EXP dari minion di early game. Dapat di-upgrade menjadi varian khusus tergantung item jungle yang digunakan.",
      "cooldown": 35,
      "unlocked_at_level": 3
    },
    {
      "icon": "/assets/battle_spells/inspire.png",
      "name": "Inspire",
      "usage": "Meningkatkan basic attack",
      "description": "Selama beberapa detik, basic attack hero meningkat drastis: attack speed dinaikkan di atas batas normal, serangan mengabaikan sebagian pertahanan musuh, dan setiap serangan basic memulihkan sedikit HP. Sangat cocok untuk marksman atau fighter yang mengandalkan basic attack.",
      "cooldown": 75,
      "unlocked_at_level": 5
    },
    {
      "icon": "/assets/battle_spells/sprint.png",
      "name": "Sprint",
      "usage": "Mobilitas dan kabur",
      "description": "Meningkatkan movement speed hero secara besar dalam waktu singkat dan memberikan efek kebal terhadap slow. Kecepatan tambahan akan berkurang secara bertahap setelah beberapa detik pertama. Digunakan untuk mengejar musuh atau melarikan diri dari kejaran.",
      "cooldown": 100,
      "unlocked_at_level": 7
    },
    {
      "icon": "/assets/battle_spells/revitalize.png",
      "name": "Revitalize",
      "usage": "Heal area untuk tim",
      "description": "Memanggil area Healing Spring di tanah yang secara berkala memulihkan persentase HP maksimum kepada hero yang berada di dalam area tersebut. Selain itu, meningkatkan efek shield dan regen HP untuk sekutu di area, sehingga sangat kuat saat war di area sempit.",
      "cooldown": 100,
      "unlocked_at_level": 9
    },
    {
      "icon": "/assets/battle_spells/aegis.png",
      "name": "Aegis",
      "usage": "Perisai bertahan",
      "description": "Memberikan shield besar kepada hero pengguna selama beberapa detik untuk menyerap damage yang masuk. Rekan tim terdekat dengan HP terendah juga mendapatkan shield lebih kecil. Efektif untuk melindungi diri atau core saat team fight.",
      "cooldown": 90,
      "unlocked_at_level": 11
    },
    {
      "icon": "/assets/battle_spells/petrify.png",
      "name": "Petrify",
      "usage": "Crowd control area",
      "description": "Memberikan Magic Damage ke musuh di sekitar dan membuat mereka terkena efek petrify dalam waktu singkat, kemudian diikuti efek slow. Sangat berguna untuk hero dengan kombo area yang butuh penguncian musuh di tempat.",
      "cooldown": 90,
      "unlocked_at_level": 13
    },
    {
      "icon": "/assets/battle_spells/purify.png",
      "name": "Purify",
      "usage": "Melepas crowd control",
      "description": "Secara instan menghapus hampir semua efek negatif yang menempel pada hero pengguna seperti stun, slow, dan efek kontrol lain. Setelah digunakan, hero juga mendapatkan kekebalan terhadap crowd control dan peningkatan movement speed dalam waktu singkat.",
      "cooldown": 90,
      "unlocked_at_level": 15
    },
    {
      "icon": "/assets/battle_spells/flameshot.png",
      "name": "Flameshot",
      "usage": "Poke jarak jauh dan zoning",
      "description": "Menembakkan proyektil api ke arah yang ditentukan. Musuh yang terkena akan menerima Magic Damage yang semakin besar jika jarak tembakan lebih jauh, serta terkena efek slow singkat. Saat digunakan, Flameshot juga mendorong musuh yang berada sangat dekat dengan hero pengguna menjauh.",
      "cooldown": 50,
      "unlocked_at_level": 17
    },
    {
      "icon": "/assets/battle_spells/flicker.png",
      "name": "Flicker",
      "usage": "Blink dan reposition",
      "description": "Memindahkan hero dalam jarak pendek ke arah yang dipilih secara instan, lalu memberikan tambahan Physical dan Magic Defense untuk sesaat. Sangat berguna untuk menghindari skill musuh, mengejar target, atau melakukan inisiasi dan combo tiba-tiba.",
      "cooldown": 120,
      "unlocked_at_level": 19
    },
    {
      "icon": "/assets/battle_spells/arrival.png",
      "name": "Arrival",
      "usage": "Teleport ke objektif",
      "description": "Setelah channeling beberapa detik, hero berteleportasi ke turret, base, atau minion tim yang dipilih dan mendapatkan movement speed tambahan yang menurun secara bertahap. Jika channeling dibatalkan atau terganggu, sebagian cooldown spell akan dikembalikan.",
      "cooldown": 75,
      "unlocked_at_level": 21
    },
    {
      "icon": "/assets/battle_spells/vengeance.png",
      "name": "Vengeance",
      "usage": "Refleksi damage dan tanking",
      "description": "Selama beberapa detik, setiap kali hero menerima damage, sebagian dari damage tersebut dipantulkan kembali ke penyerang sebagai Magic Damage. Selain itu, hero juga mendapatkan pengurangan damage yang signifikan selama durasi efek.",
      "cooldown": 75,
      "unlocked_at_level": 23
    }
  ]
}
